#include <iostream>

using namespace std;

struct TDate // структура для зберігання інформації про дату, яка містить поля для дня, місяця та року
{
    int Day;
    int Month;
    int Year;
};

struct TTemperature // структура для зберігання інформації про температуру, яка містить поле для температури в градусах Фаренгейта
{
    double tf; // температура в градусах Фаренгейта
    double tc; // температура в градусах Цельсія
};

struct TBoolean // структура для зберігання інформації про два цілих числа та булевий результат, яка містить поля для двох цілих чисел A і B, які будуть використовуватися для визначення, чи є рівно одне з них непарним, і поле для зберігання булевого результату, який вказує, чи є рівно одне з чисел A і B непарним
{
    int A; // перше ціле число
    int B; // друге ціле число
    bool result; // булевий результат
};

void Param(); // Task 1

void EnterConsole(TDate dates[5]); // метод для того щоб ввести дані про дати з консолі
void Processing(TDate dates[5], int days[5]); // метод для обробки даних та визначення кількості днів у місяці для кожної дати
void ShowResult(int days[5]); // метод для виведення результатів на консоль, який показує кількість днів у місяці для кожної з 5 дат

int DaysInMonth(TDate D); // метод для визначення кількості днів у місяці для заданої дати, який враховує різну кількість днів у різних місяцях та враховує високосні роки
bool isLeapYear(int year); // метод для визначення, чи є заданий рік високосним, який повертає true, якщо рік є високосним, і false в іншому випадку

void Begin31(); // Task 2

void EnterConsole2(double &tf); // метод для введення температури в градусах Фаренгейта з консолі
void Processing2(double tf, double &tc); // метод для обробки даних та перетворення температури з Фаренгейта в Цельсій, який використовує формулу перетворення: C = (F - 32) * 5 / 9
void ShowResult2(double tc); // метод для виведення результатів на консоль, який показує температуру в градусах Цельсія після перетворення з Фаренгейта

double FahrenheitToCelsius(double tf); // метод для перетворення температури з Фаренгейта в Цельсій, який використовує формулу перетворення: C = (F - 32) * 5 / 9 і повертає результат у градусах Цельсія

void Boolean10(); // Task 3

void EnterConsole3(int &A, int &B); // метод для введення двох цілих чисел A і B з консолі, які будуть використовуватися для визначення, чи є рівно одне з них непарним
void Work3(int A, int B, bool &result); // метод для обробки даних та визначення, чи є рівно одне з чисел A і B непарним, який використовує логічну операцію XOR для визначення результату
void ShowResult3(bool result); // метод для виведення результатів на консоль, який показує результат визначення, чи є рівно одне з чисел A і B непарним, виводячи "true" або "false" залежно від результату

int main()
{
    int menu; // змінна вв який зберігається вибір користувача

    while (menu != 0) { // цикл для меню
        cout << "Choose task (1: Param, 2: Begin31, 3: Boolean10, 0: Exit): "; // просимо користувача ввести таск який йому захочеться
        cin >> menu;

        switch (menu) { // вибір таску
            case 1:
                Param();
                break;
            case 2:
                Begin31();
                break;
            case 3:
                Boolean10();
                break;
            case 0:
                cout << "Exiting...\n";
                break;
            default:
                cout << "Invalid option. Please try again.\n";
        }
    }

    cin.get(); // віхід з програми після натискання клавіші
    return 0;
}

void Param()
{
    TDate dates[5]; // масив для зберігання 5 дат, який використовується для зберігання інформації про 5 різних дат, введених користувачем
    int days[5]; // масив зберігання днів у місяці

    EnterConsole(dates); // метод за допомогою якого користувач вводить дані
    Processing(dates, days); // метод для обробки данних дат
    ShowResult(days); // виводимо результат
}

void EnterConsole(TDate dates[5])
{
    for(int i = 0; i < 5; i++){ // цикл для введення даних про 5 дат, який повторюється 5 разів, щоб користувач міг ввести інформацію про 5 різних дат
        cout << "Enter day, month, year for date " << i+1 << ": ";
        cin >> dates[i].Day >> dates[i].Month >> dates[i].Year;
    }
}

void Processing(TDate dates[5], int days[5])
{
    for(int i = 0; i < 5; i++){ // цикл для обробки даних про 5 дат, який повторюється 5 разів, щоб обробити інформацію про 5 різних дат
        days[i] = DaysInMonth(dates[i]);
    }
}

void ShowResult(int days[5])
{
    for(int i = 0; i < 5; i++){ // цикл для виведення результатів
        cout << "Days in month for date " << i+1 << ": " << days[i] << endl;
    }
}

int DaysInMonth(TDate D)
{
    int daysInMonth[] = { 31, 28, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31 }; // масив, який містить кількість днів у кожному місяці для звичайного року
    
    if (D.Month == 2 && isLeapYear(D.Year)) // перевірка, чи є місяць лютий і чи є рік високосним, щоб визначити, чи потрібно враховувати 29 днів у лютому
        return 29;
 
    return daysInMonth[D.Month - 1]; // повертаємо кількість днів у місяці, використовуючи індекс місяця (від 1 до 12) для доступу до відповідного елемента масиву daysInMonth, який містить кількість днів у кожному місяці для звичайного року 
}

bool isLeapYear(int year)
{
    return (year % 4 == 0 && year % 100 != 0) || (year % 400 == 0); // перевірка, чи є рік високосним, використовуючи правила високосного року: рік є високосним, якщо він кратний 4, але не кратний 100, або якщо він кратный 400
}

void Begin31()
{
    double tf, tc; // змінні для зберігання температури в градусах Фаренгейта (tf) і Цельсія (tc), які використовуються для зберігання введеної температури в Фаренгейтах та обчисленої температури в Цельсіях відповідно

    TTemperature temp; // структура для зберігання інформації про температуру, яка містить поле для температури в градусах Фаренгейта (tf) і Цельсія (tc), яка використовується для зберігання введеної температури в Фаренгейтах та обчисленої температури в Цельсіях відповідно

    EnterConsole2(tf); // метод для введення температури в градусах Фаренгейта з консолі, який запитує користувача ввести температуру в Фаренгейтах і зберігає її у змінній tf
    Processing2(temp, tf, tc); // метод для обробки даних та перетворення температури з Фаренгейта в Цельсій, який використовує формулу перетворення: C = (F - 32) * 5 / 9, щоб обчислити температуру в Цельсіях на основі введеної температури в Фаренгейтах і зберегти результат у змінній tc
    ShowResult2(tc); // метод для виведення результатів на консоль, який показує температуру в градусах Цельсія після перетворення з Фаренгейта, який виводить обчислену температуру в Цельсіях на консоль
}

void EnterConsole2(double &tf)
{
    cout << "Enter temperature in Fahrenheit: "; // запитує користувача ввести температуру в Фаренгейтах і зберігає її у змінній tf, яка передається за посиланням, щоб зміни, внесені в цю змінну всередині методу, були видимі поза межами цього методу
    cin >> tf; // зчитує введену користувачем температуру в Фаренгейтах і зберігає її у змінній tf
}

void Processing2(TTemperature temp, double tf, double &tc)
{
    tc = FahrenheitToCelsius(tf); // викликає метод FahrenheitToCelsius, який перетворює температуру з Фаренгейта в Цельсій, передаючи введену температуру в Фаренгейтах (tf) як аргумент, і зберігає результат у змінній tc, яка передається за посиланням, щоб зміни, внесені в цю змінну всередині методу, були видимі поза межами цього методу

    temp.tf = tf; // зберігає введену температуру в Фаренгейтах у полі tf структури temp
    temp.tc = tc; // зберігає обчислену температуру в Цельсіях у полі tc структури temp
}

void ShowResult2(double tc)
{
    cout << "Temperature in Celsius: " << tc << endl; // виводить обчислену температуру в Цельсіях на консоль, використовуючи змінну tc, яка містить результат перетворення температури з Фаренгейта в Цельсій
}

double FahrenheitToCelsius(double tf)
{
    return (tf - 32) * 5.0 / 9.0; // перетворює температуру з Фаренгейта в Цельсій, використовуючи формулу перетворення: C = (F - 32) * 5 / 9, де tf - це температура в Фаренгейтах, яка передається як аргумент, і повертає результат у градусах Цельсія
}

void Boolean10()
{
    TBoolean boolStruct; // структура для зберігання інформації про два цілих числа та булевий результат, яка містить поля для двох цілих чисел A і B, які будуть використовуватися для визначення, чи є рівно одне з них непарним, і поле для зберігання булевого результату, який вказує, чи є рівно одне з чисел A і B непарним

    int &A = boolStruct.A; // посилання на перше ціле число A в структурі boolStruct, яке використовується для зберігання введеного користувачем першого цілого числа, яке буде використовуватися для визначення, чи є рівно одне з них непарним, и сохраняет его в переменной A, которая передается по ссылке, чтобы изменения, внесенные в эту переменную внутри метода, были видимы за пределами этого метода
    int &B = boolStruct.B; // посилання на друге ціле число B в структурі boolStruct, яке використовується для зберігання введеного користувачем другого цілого числа, яке буде використовуватися для визначення, чи є рівно одне з них непарним, и сохраняет его в переменной B, которая передается по ссылке, чтобы изменения, внесенные в эту переменную внутри метода, были видимы за пределами этого метода

    bool &result = boolStruct.result; // посилання на булевий результат в структурі boolStruct, яке використовується для зберігання результату визначення, чи є рівно одне з чисел A і B непарним, и сохраняет его в переменной result, которая передается по ссылке, чтобы изменения, внесенные в эту переменную внутри метода, были видимы за пределами этого метода
    
    EnterConsole3(A, B); // метод для введення двох цілих чисел A і B з консолі, який запитує користувача ввести два цілих числа A і B, які будуть використовуватися для визначення, чи є рівно одне з них непарним, и сохраняет их в переменных A и B
    Work3(A, B, result); // метод для обробки даних та визначення, чи є рівно одне з чисел A і B непарним, який використовує логічну операцію XOR для визначення результату, передаючи введені числа A і B як аргументи, и сохраняет результат в переменной result, которая передается по ссылке, чтобы изменения, внесенные в эту переменную внутри метода, были видимы за пределами этого метода
    ShowResult3(result); // метод для виведення результатів на консоль, який показує результат визначення, чи є рівно одне з чисел A і B непарним, виводячи "true" або "false" залежно від результату, використовуючи змінну result, яка містить булеве значення, що вказує, чи є рівно одне з чисел A і B непарним
}

void EnterConsole3(int &A, int &B)
{
    cout << "Enter A and B: "; // запитує користувача ввести два цілих числа A і B, які будуть використовуватися для визначення, чи є рівно одне з них непарним, и сохраняет их в переменных A и B, которые передаются по ссылке, чтобы изменения, внесенные в эти переменные внутри метода, были видимы за пределами этого метода
    cin >> A >> B;
}

void Work3(int A, int B, bool &result)
{
    result = (A % 2 != 0) != (B % 2 != 0); // визначає, чи є рівно одне з чисел A і B непарним, використовуючи логічну операцію XOR для визначення результату, де (A % 2 != 0) перевіряє, чи є число A непарним, а (B % 2 != 0) перевіряє, чи є число B непарним, и сохраняет результат в переменной result, которая передается по ссылке, чтобы изменения, внесенные в эту переменную внутри метода, были видимы за пределами этого метода
}

void ShowResult3(bool result)
{
    cout << "Exactly one is odd: " << (result ? "true" : "false") << endl; // виводить результат визначення, чи є рівно одне з чисел A і B непарним, виводячи "true" або "false" залежно від результату, використовуючи змінну result, яка містить булеве значення, що вказує, чи є рівно одне з чисел A і B непарним
}